<template>
  <layout :showNavbar="isNavbar">
    <navbar :title="$route.meta.title" slot="navbar">
    </navbar>
    <section class="protocol-group">
      <div class="protocol-main">
        <div class="summary">
          <p>为使用本网站及服务，请您务必审慎阅读、充分理解本协议各项条款，特别是免除或者限制责任的条款，以及开通或使用某些服务的单独协议或条款，并选择接受或不接受。 </p>
          <p> 除非您已阅读并接受本协议所有条款，否则您无权就本借贷项目有进一步操作的权利，包括但不限于获取借款项目信息、向借款人出借资金等。您点击或勾选“同意接受本协议”即视为您已阅读并同意受本协议的约束。 </p>
          <p>在完成本次操作之前，请您确认自己填写的注册信息与有权机关颁发的证件证照保持一致，包括但不限于身份信息、银行账户信息等，且您本人系具有完全民事行为能力的自然人或其他法律主体，同时愿意承受相应投资风险。</p>
        </div>
        <h1 class="primary-title">借款协议</h1>
        <table style="width: 100%; margin-bottom: .3rem">
          <tr>
            <th width="80%" style="text-align:right;"></th>
            <td style="white-space: nowrap;">合同编号：{{protocolData.contractNo}}</td>
          </tr>
          <tr>
            <th style="text-align:right;"></th>
            <td>合同签订地：杭州</td>
          </tr>
        </table>

        <table class="table-contract">
          <tr>
            <td><strong>甲方（出借人）：</strong><span>{{protocolData.partyAName}}</span></td>
          </tr>
          <tr>
            <td>身份证号码/营业执照号：<span>{{protocolData.partyAIdentityNumber}}</span></td>
          </tr>
          <tr>
            <td>联系电话：<span>{{protocolData.partyAMobile}}</span></td>
          </tr>
          <tr>
            <td style="padding-top: .5rem"><strong>乙方（借款人）：</strong><span>{{protocolData.partyBName}}</span></td>
          </tr>
          <tr>
            <td>身份证号码/营业执照号：<span>{{protocolData.partyBLicense}}</span></td>
          </tr>
          <tr>
            <td>地址：<span>{{protocolData.partyBAddress}}</span></td>
          </tr>
          <tr>
            <td>联系电话：<span>{{protocolData.partyBTelephone}}</span></td>
          </tr>
          <tr>
            <td style="padding-top: .5rem;"><strong>丙方（居间人）：</strong>昇融资产管理有限公司</td>
          </tr>
          <tr>
            <td>住所：杭州市拱墅区远洋国际金座 825 室</td>
          </tr>
          <tr>
            <td>联系电话：4000998799</td>
          </tr>
        </table>

        <dl>
          <dt style="text-indent: 0">鉴于：</dt>
          <dd>1.丙方是一家依法设立于浙江省杭州市并有效存续的有限责任公司，开发并运营了长富理财网络借贷信息中介机构（https://www.changfulicai.com/，下文均简称“长富理财”），并为各主体在长富理财上达成的交易提供信息服务；</dd>
          <dd>2.乙方在生产生活当中存在资金短缺，有借款需求。为缓解资金压力，乙方通过其代理人将其借款信息，包括但不限于借款人信息、担保人信息、担保物信息，提供给丙方，经丙方形式审查后由丙方在其运营的长富理财发布；</dd>
          <dd>3.甲方已在长富理财平台上完成注册程序，对丙方运营模式和借款需求及其存在的风险有充分认知，在平等、自愿的前提下通过长富理财将其自有资金出借给乙方。</dd>
          <dd>4.甲乙双方均同意通过长富理财签署本电子合同并完成全部借款交易。本电子合同储存于丙方指定服务器当中，除本合同另有约定外，合同一经生成，任何一方或多方不得擅自修改本电子合同内容。</dd>
        </dl>

        <h2 class="sub-title">第一部分 借款事项</h2>

        <table class="protocol-table">
          <tr>
            <th>借款总额</th>
            <td colspan="3">人民币（大写）：{{protocolData.projectAmountCH}}（￥ {{protocolData.projectAmount}}）</td>
          </tr>
          <tr>
            <th>甲方出借金额</th>
            <td colspan="3">人民币（大写）：{{protocolData.investAmountCH}}（￥ {{protocolData.investAmount}}）</td>
          </tr>
          <tr>
            <th>借款募集期</th>
            <td colspan="3">{{protocolData.collectionStartTime}} 至 {{protocolData.establishTime}}</td>
          </tr>
          <tr>
            <th width="25%">基础借款利率</th>
            <td width="25%">{{protocolData.expectAnnualizedRate}}%/年</td>
            <th width="25%">本息支付详情</th>
            <td width="25%">详见系统自动生成的还款列表</td>
          </tr>
          <tr>
            <th>生效日期</th>
            <td>{{protocolData.establishTime}}</td>
            <th>到期日期</th>
            <td>{{protocolData.projectEndTime}}</td>
          </tr>
          <tr>
            <th>起息日</th>
            <td>{{protocolData.projectStartTime}}</td>
            <th>计息方式</th>
            <td>{{protocolData.profitType}}</td>
          </tr>
          <tr>
            <th>借款成功的条件</th>
            <td colspan="3">借款筹集期内，根据长富理财平台的系统登记，出借资金总额不低于拟借款金额的 0%</td>
          </tr>
          <tr>
            <td colspan="4">备注：本协议的所有还款均要求借款人在还本付息日的 23：00 点前按本协议约定支付，否则视为违约。</td>
          </tr>
        </table>

        <dl>
          <dt style="text-indent: 0">1、借款成功的条件</dt>
          <dd>借款筹集期间届满，根据长富理财平台系统的登记，出借资金总额不低于上述表格约定的“借款成功条件”的，为借款成功，借款人与出借人之间的借贷关系成立；否则为借款不成功，借贷关系不成立。</dd>
        </dl>

        <dl>
          <dt style="text-indent: 0">2、借款不成功的处理</dt>
          <dd>出借人同意：借款不成功的，自借款筹集期间届满之日（含）起 3 个工作日内，由平台向出借人按原支付路径退还出借人的出借金额。</dd>
        </dl>

        <h2 class="sub-title">第二部分 本借款协议相关具体条款</h2>

        <dl>
          <dt>第 1 条 名词定义</dt>
          <dd>除非上下文另有解释，下列用语具有以下含义：</dd>
          <dd>1.1 本协议：指本《借款协议》第一部分、第二部分及所有附件中的任何条款、明细和信息。</dd>
          <dd>1.2 出借人：指本协议第一部分中列明的出借人，为符合中华人民共和国法律（即中国法律，不包括香港特别行政区、澳门特别行政区和台湾地区的法律法规）规定的具有完全民事权利能力和民事行为能力，能独立行使和承担协议项下权利义务的自然人。出借人须为长富理财的注册用户；</dd>
          <dd>1.3 借款人：指本协议第一部分中列明的借款人，为符合中国法律规定的具有完全民事权利能力和民事行为能力，能独立承担本协议项下权利义务的自然人、法人或其他组织。</dd>
          <dd>1.4 支付机构：指在本协议各方之间作为中介机构提供资金转移服务的<strong>银行或第三方支付结算机构</strong>；</dd>
          <dd>1.5 长富理财：指昇融资产管理有限公司经营的提供网络借贷信息中介服务的互联网平台。</dd>
          <dd>1.6 自有奖励：指丙方根据长富理财规则在出借人投资时给予出借人的相应奖励（包括但不限于在基础借款利率上给予加息等）。</dd>
          <dd>1.7 系统奖励：指丙方根据长富理财规则在出借人投资时给予出借人的相应奖励（包括但不限于在基础借款利率上给予加息等）。</dd>
        </dl>

        <dl>
          <dt>第 2 条 本协议的订立与支付</dt>
          <dd>2.1 各方同意并确认，各方通过自行或授权其代理人根据长富理财有关规则和说明，在丙方点击确认相关按钮或委托代理人操作进行借款申请和投标操作的方式确认签署本协议。</dd>
          <dd>2.2 各方在丙方网站进行借款申请操作和投标操作之前，均需仔细阅读并确认同意本协议各条款以及同意本协议的签署。各方通过上述方式签署本协议且各出借人同意在协议达到相应的生效条件后，本协议将在丙方保存，各方均可向丙方申请查阅。</dd>
          <dd>2.3 出借人、借款人在此不可撤销的同意并授权：丙方于本协议生效后将已充值至甲方开立于长富理财平台账户的拟出借资金或出借人已支付至支付机构的拟出借资金划付至乙方开立于长富理财的账户或乙方指定的其他收款账户完成本协议项下资金的出借。</dd>
          <dd>2.4 各方在此确认，对于借款人在本协议项下应还借款本息按照如下约定进行支付：</dd>
          <dd>2.4.1 借款人应于约定的还款日，将应还借款本金及/或利息以授权丙方划扣并委托丙方划入甲方的长富理财平台账户的形式，支付予出借人。</dd>
        </dl>

        <dl>
          <dt>第 3 条 关于各方权利义务</dt>
          <dd>3.1 出借人及借款人（合称“双方”）的权利及义务</dd>
          <dd>3.1.1 双方已认真阅读和理解本协议所有内容并自愿按本协议相关约定履行各自的权利义务。</dd>
          <dd>3.1.2 出借人有自行选择借款人及出借额度，并最终决定是否出借资金给特定借款人的权利。</dd>
          <dd>3.1.3 双方应妥善保管自己网站的注册用户名和密码，自行承担因注册用户名和密码丢失、泄露或允许他人使用所产生的后果。任何一方通过其用户名和密码登陆的任何操作均视为该方本人的真实意思表示。</dd>
          <dd>3.1.4 双方应基于合法目的使用服务平台，不得以该平台进行信用卡套现、洗钱或从事其他任何违法、违纪行为，否则应依法承担由此产生的法律责任与后果。</dd>
          <dd>3.1.5 双方有义务按照丙方的要求在丙方平台上进行操作，真实、准确、完整的填写其相关信息（包括但不限于电子邮件地址、手机号码等）。因双方操作不当或填写的相关信息有误造成的法律后果、经济损失均尤其各方自行承担。</dd>
          <dd>3.1.6 借款人同意按本协议第一部分列明的本息支付详情向出借人支付借款本息。</dd>
          <dd>3.1.7 出借人及丙方同意，借款人有权指定第三方代其向出借人及丙方履行在本合同项下的付款义务（包括但不限于应向出借人支付的借款本息及应向丙方支付的服务费等），但该第三人应当经过丙方的同意并与丙方签订相关协议。</dd>
          <dd>3.1.8 出借人按本协议第一部分约定的借款明细的约定履行出借义务，借款人按本协议第一部分约定的借款明细的约定履行还款义务。</dd>
          <dd>3.1.9 出借人有权通过长富理财查看自己名下账户相关信息及借款人还款情况。</dd>
          <dd>3.1.10 出借人在按照本协议及长富理财的规则及说明进行资金出借、债权转让等行为产生的相关税费，由出借人自行向主管税务机关申报、缴纳。</dd>
          <dd>3.1.11 借款人在申请及实现借款的全过程中，必须如实向丙方提供所要求提供的相关信息及材料；借款人同意丙方可以通过任何第三方渠道验证借款人所提供信息的真实性，且借款人应在所提供信息被认定为虚假时承担所有后果和法律责任。</dd>
          <dd>3.1.12 自本协议项下权利义务未履行完毕前，出借人和借款人及双方的本人、家庭联系人及紧急联系人的工作单位、居住地址、住所电话、手机号码、账户信息如出现变更的，应在变更后三日内通过长富理财向其他各方提供变更后的最新信息。若因任何一方未及时提供最新信息或提供虚假信息而导致其自身和/或任何其他方遭受的损失均由该未及时提交真实信息的一方承担。</dd>
          <dd>3.1.13 就借款人提供的相关信息及丙方通过合法渠道获取的与其相关的信息，丙方有权为本协议目的自行管理并使用，丙方均不承担由此信息公布造成的任何法律后果。</dd>
          <dd>3.1.14 成功借款后，丙方依据出借人的委托要求借款人按本协议约定进行还款时，借款人有义务无条件及时按照丙方发出的要求进行还款并向丙方提供协助。</dd>
          <dd>3.1.15 借款人同意：若借款人逾期 60 个自然日未全额归还借款的，丙方有权代理出借人通过包括但不限于网络、报刊、电视、征信系统等方式向任何第三方披露借款人逾期还款事实，且借款人特别确认届时丙方可以同时披露借款人所提供的或丙方自行获取的借款人相关信息。</dd>
          <dd>3.1.15 借款人同意：若借款人逾期 60 个自然日未全额归还借款的，丙方有权代理出借人通过包括但不限于网络、报刊、电视、征信系统等方式向任何第三方披露借款人逾期还款事实，且借款人特别确认届时丙方可以同时披露借款人所提供的或丙方自行获取的借款人相关信息。</dd>
          <dd>3.1.17 出借人应保证其向丙方提供的信息、资料均为合法、真实、有效，不存在任何虚假、遗漏和隐瞒；同时，出借人保证其所用于出借的资金来源合法且是该资金的合法所有人，并非任何非法活动所得，也非汇集他人之资金或出借人受托管理之财产；如因第三人对资金归属、合法性问题发生争议，由出借人负责解决并自行承担相关责任； 如因出借人违反上述约定造成借款人、丙方损失的，须由出借人赔偿；在该等争议解决（以取得生效的判决、裁决或行政命令、通知为标志）之前，丙方有权根据政府机关、司法机关或仲裁机关出具且生效的命令、判决、裁定或其他法律文件拒绝向出借人支付丙方代其领受的相关款项。</dd>
          <dd>3.2 丙方的权利及义务</dd>
          <dd>3.2.1 丙方有权根据借款人提供的各项信息及丙方独立获得的信息对借款人的借款申请进行审核并决定是否将借款人的借款需求向出借人进行推荐。</dd>
          <dd>3.2.2 丙方应按照本协议的规定，恪尽职守，以诚实、信用、谨慎、有效管理的原则为出借人、借款人提供中介服务，出借人及借款人之间的借贷关系与丙方无关。</dd>
          <dd>3.2.3 丙方同意，甲方可以在出借过程中可以根据长富理财奖励规则使用或享受丙方发放的奖励（包括但不限于现金券、年化券、红包等）。奖励规则按照长富理财公布的定义执行，同时长富理财保留根据自身经营需要而对该规则进行调整的权利。</dd>
          <dd>3.2.4 本协议和法律法规规定其他权利义务。</dd>
        </dl>

        <dl>
          <dt>第 4 条 关于债权转让</dt>
          <dd>4.1 出借人特别同意：未经丙方同意，出借人不得将本协议项下对借款人享有的债权转让给任何第三方</dd>
          <dd>4.2 借款人特别同意：未经丙方同意，借款人不得将本协议项下对出借人承担的债务转让给任何第三方。</dd>
          <dd>4.3 出借人有权依据长富理财规则、说明及本协议约定将本协议项下的债权通过长富理财转让给在长富理财注册的第三人。但出借人未依据长富理财转让规则转让的债权，丙方不予承认，借款人亦无须对新的债权受让人履行还款义务。</dd>
          <dd>4.4 在出借人按照长富理财规则、说明及本协议约定将部分或全部债权转让后，借款人需对新债权人继续履行本协议下其对出借人的所有义务，不得以未接到债权转让通知为由拒绝履行还款义务。</dd>
        </dl>

        <dl>
          <dt>第 5 条 关于违约责任</dt>
          <dd>5.1 若借款人在长富理财上显示的还款期限内未足额还款的，借款人应按照相应合同文本约定（包括但不限于本协议、乙方与丙方以其他形式签订的协议）承担违约责任；</dd>
          <dd>5.2 若借款人逾期支付本息的，每逾期一日，借款人须按逾期总金额的年化 24%向出借人支付逾期违约金，直至本金、利息及逾期违约金全部清偿完毕之日止。</dd>
          <dd>5.3 若借款人违约的，则借款人须按借款本金的年化 24%向丙方支付违约金。</dd>
          <dd>5.4 若借款人没有足额偿还借款本息的，所偿还之金额应按照违约金、利息、本金之顺序偿还。</dd>
          <dd>5.5 因借款人及出借人违约而给丙方造成损失的，借款人及出借人应当承担赔偿责任。</dd>
          <dd>5.6 发生以下一项或几项情形时，均视为借款人违约：</dd>
          <dd>（1）借款人违反其在本协议中所做的任何承诺或保证内容的；</dd>
          <dd>（2）借款人的任何财产遭受没收、征用、查封、扣押、冻结等可能影响其履行能力的不利事件，且未及时对其他各方进行书面通知或不能及时提供有效补救措施的；</dd>
          <dd>（3）借款人的财务状况出现实质性影响其履约能力的不利变化，且未及时对其他各方进行书面通知或不能及时采取有效补救措施的。</dd>
          <dd>5.7 丙方认为借款人发生或可能发生违约时，丙方有权采取以下一项或几项救济措施：</dd>
          <dd>（1）立即暂缓、取消发放全部或部分借款；</dd>
          <dd>（2）宣布已发放借款全部提前到期，要求借款人应立即偿还所有应付款项；</dd>
          <dd>（3）解除本协议；</dd>
          <dd>（4）采取法律、法规以及本协议约定的其他救济措施。</dd>
        </dl>

        <dl>
          <dt>第 6 条 委托授权</dt>
          <dd>6.1 出借人在此同意并确认，授权丙方或转委托他人作为其代理人为如下之行为：</dd>
          <dd>6.1.1 若本借款协议涉及到担保的，丙方或丙方转委托的第三人有权以己方的名义代出借人与借款人签订相关线下协议，以完成资金交付及担保手续的办理，包括但不限于办理房屋抵押、车辆质押、动产抵押、股权质押手、质押物交付、担保方担保及其他相关事宜。</dd>
          <dd>6.1.2 代理其行使其在本协议项下之各项权利，包括但不限于受领借款人（或其他主体代借款人）偿付的借款本息并向出借人、丙方平台进行支付、按照本协议第 5 条规定宣布借款人借款全部提前到期、向借款人进行借款的违约提醒及催收工作（包括但不限于电话通知、上门通知、发律师函、对借款人提起诉讼等）。同时，丙方有权单方面委托其他主体进行前述借款的违约提醒和催收工作。</dd>
          <dd>6.1.3 在丙方认为借款人发生或可能发生违约时，出借人特别授权丙方为出借人寻找债权受让人并办理一切债权转让的相关的手续（包括但不限于签订债权转让合同、决定债权转让对价，收取债权转让款、交接债权转让文件等），丙方代出借人签订的相关债权转让合同在债权受让人将债权转让款通过丙方支付给出借人后生效。</dd>
          <dd>6.2 借款人在此同意并确认，授权丙方作为其代理人为如下之行为：</dd>
          <dd>6.2.1 借款人在此同意并确认，授权丙方作为其代理人，根据借款人与出借人签署的本协议，划扣借款人存入其指定之还款账户的还款资金并代理借款人以该等资金偿付本协议项下借款人应付之各项款项；具体支付事宜以本协议约定为准。并可从事借款人在本协议项下委托之其他事项。</dd>
          <dd>6.2.2 借款人在此同意并确认，授权丙方在本协议生效后，从借款人丙方账户或第三方托管账户或其他银行账户中，将借款人在本协议项下应支付予出借人的借款本息直接划扣并支付予出借人。</dd>
          <dd>6.3 借款人及出借人在此同意并确认，除本协议另有约定外，丙方对于借款人在本协议项下应付之任何款项，丙方均不承担任何偿付责任；当借款人发生违约时，出借人应当直接或委托丙方向借款人主张违约责任。</dd>
          <dd>6.4 借款人及出借人再次确认并理解委托授权给丙方代理的事项所代表的法律意义，且丙方接受委托的行为并不代表其必须完成委托事项，也并不代表其对借款人的还款及出借人的本息做出任何承诺。</dd>
        </dl>

        <dl>
          <dt>第 7 条 关于法律适用及管辖</dt>
          <dd>7.1 适用法律。本协议的全部事项，包括但不限于本协议的效力、解释、履行以及争议的解决均受中国法律管辖；本协议项下任一条款如与中国法律中的强制性规范相抵触，应在该等强制性规范所不禁止的最大限度内进行解释和执行，且任何该等与强制性规范相抵触的约定不应影响本协议其他条款的效力。</dd>
          <dd>7.2 争议管辖。各方一致同意，如发生争议，不论争议金额大小，均提交丙方所在地有管辖权的人民法院诉讼解决。如该争议事项确定需要通过诉讼的方式解决，甲方在此不可撤销地授权丙方或由其转委托他人作为甲方的代理人，并以代理人自身名义处理甲方与乙方诉讼事宜。</dd>
          <dd>7.3 在诉讼期间，本协议中不涉及争议的条款仍须履行，各方均不得以解决争议为由拒不履行其在本协议项下的任何义务。</dd>
        </dl>

        <dl>
          <dt>第 8 条 特别条款</dt>
          <dd>8.1 若经丙方认可的第三方愿意为本协议项下的借款提供担保或代偿的，甲方同意就第三方代乙方向甲方偿付的相应款项所对应的相应债权无条件自动转让给第三方，协助第三方向乙方进行追索，并委托丙方向借款人发送债权转让通知。</dd>
          <dd>8.2 针对上述债权转让行为或甲方将债权转让给丙方认可的其他第三方的行为，乙方同意丙方可以通过网站公告、短信通知、邮件通知、身份证地址等多种方式向乙方送达债权转让通知，上述通知一经丙方发出即视为乙方收到，乙方不得以任何理由提出异议。</dd>
        </dl>

        <dl>
          <dt>第 9 条 关于其他</dt>
          <dd>9.1 各方确认，在本协议第一部分所列明的借款筹集期间届满且借款筹集期间内甲方累计出借的资金未达到借款成功条件的，丙方有权按以下任一方式进行执行：</dd>
          <dd>9.1.1 单方面决定按第一部分借款不成功的方式处理；</dd>
          <dd>9.1.2 对于达到借款成功条件但未达到计划借款总金额的，借款人的实际借款总额以出借人依据本协议实际出借的借款总额为准。对于借款人计划借款总额与实际借款总额的差额部分，丙方有权按照长富理财规则在长富理财上为借款人重新发起借款申请以向长富理财注册用户筹集借款人计划借款总额与实际借款总额的差额部分。</dd>
          <dd>9.2 协议的生效。本协议在同时满足以下条件的当日为本协议生效之日：</dd>
          <dd>a.本协议约定的借款筹集期间届满，或在借款筹集期间内甲方累计出借的资金达到借款人借款计划的；</dd>
          <dd>b.丙方根据本协议约定将出借人的实际出借总额支付给借款人的，如丙方根据本协议约定将出借人的出借资金支付给借款人之日与出借人签订本协议之日为同一日的，则本协议生效之日推迟至出借人签订本协议之日后的第二日。</dd>
          <dd>9.3 各方确认，如因借款人提供的收款账户问题（包括但不限于开户行错误、开户行比较偏远、开户行非大型银行、收款账号错误、收款账户不能做到即时到账、第三方支付问题等）导致丙方按本协议约定将出借人的出借资金支付至借款人的长富理财账户或借款人指定的收款账户后被退回或多次支付或借款人迟延收到的，不影响本协议生效之日的确定。如丙方按本协议约定将出借人的出借资金支付至借款人的长富理财账户或借款人指定的收款账户后被退回的，丙方有权将出借人的出借资金按借款人提前还款处理。</dd>
          <dd>9.4 本协议项下的附件属于本协议不可分割的组成部分。本协议任何条款的标题仅系为方便援引和阅读而设置，不得被用于解释本协议任何条款的依据。</dd>
          <dd>9.5 本协议签订后，各方均同意长富理财上的相关规则、说明及其他相关资料都属于本协议的一部分，长富理财对相关规则说明及其他相关资料的资料的修改、删减或补充视为对本协议作出的变更，各方应当遵守。</dd>
        </dl>

        <table class="table-contract">
          <tr>
            <td><strong>甲方（出借人）：</strong><span>{{protocolData.partyAName}}</span></td>
          </tr>
          <tr>
            <td>证件号：<span>{{protocolData.partyAIdentityNumber}}</span></td>
          </tr>
          <tr>
            <td style="padding-top: .5rem"><strong>乙方（借款人）：</strong><span>{{protocolData.partyBName}}</span></td>
          </tr>
          <tr>
            <td>证件号：<span>{{protocolData.partyBLicense}}</span></td>
          </tr>
          <tr>
            <td style="padding-top: .5rem" colspan="2"><strong>丙方(居间人)：</strong>昇融资产管理有限公司</td>
          </tr>
          <tr>
            <td colspan="2">住所：杭州市拱墅区远洋国际金座 825 室</td>
          </tr>
        </table>
      </div>
    </section>
  </layout>
</template>
<script>
  export default{
    data(){
      return {
        isNavbar: true,
        transactionNo: '',
        protocolData:''
      }
    }, created(){
      this.isOsAccess()
    },
    methods: {
      isOsAccess(){
        if (this.$route.query.os === 'app_ios' || this.$route.query.os === 'app_android' ) {
          this.isNavbar = false
        }
        if( this.$route.query.access_token !== undefined){
          this.$dialog.loading.open('数据加载中...');
          this.axios.get('auth/ucMemebe/info').then((res) => {
            if (res.success) {
              this.accountInfo = res.result
              this.transactionNo = this.$route.query.id
              this.getContractData()
              localStorage.setItem('accountinfo', JSON.stringify(res.result))
            } else if (res.error === 'MEMBER_TOKEN_INVALID_ERROR') {
              this.$dialog.toast({mes: res.errorDescription})
              localStorage.clear()
              this.goLogin()
            } else {
              this.$dialog.toast({mes: res.errorDescription})
            }
          })
        } else {
          this.transactionNo = this.$route.query.id
          this.getContractData()
        }
      },
      goBack(){
        this.$router.back()
      },
      getContractData(){
        this.$dialog.loading.open('数据加载中...');
        this.axios.get('auth/myInvest/getContractData/'+ this.transactionNo).then(res => {
          if (res.success) {
            this.protocolData = res.result
          } else if(res.error === 'TC_ORDER_TRANSACTION_NOT_EXISTS_ERROR'){
            this.goInvestsList()
          } else if(res.error === 'MEMBER_TOKEN_INVALID_ERROR'){
            this.goLogin()
          }
        })
      },
      goLogin(){
        if (this.$route.query.os === 'app_ios' || this.$route.query.os === 'app_android') {
          window.location.href = 'cflc://jsbridge?type=action&name=login'
        } else {
          this.$router.push('/login')
        }
      },
      goInvestsList(){
        if (this.$route.query.os === 'app_ios' || this.$route.query.os === 'app_android') {
          window.location.href = 'cflc://jsbridge?type=event&name=close'
        } else {
          this.$router.push('/account/wait_establish_invests')
        }
      },
    }
  }
</script>
<style lang="less">
  @import "borrowing_agreements";
</style>
