<template>
  <layout :showNavbar="isNavbar">
    <navbar :title="$route.meta.title"
            slot="navbar">
    </navbar>
    <section class="protocol-group">
      <div class="protocol-body">
        <h1 style='font-size: 30px; margin-bottom: 0.5rem;'>风险揭示书</h1>
        <div class="protocol-info protocal-main">
          <p> 尊敬的客户：</p>
          <p class='indent2'>以上朗润金融为平台的期货授信业务是一种潜在收益和潜在风险较 高的投资品种，对客
            户理解风险的能力、控制风险的能力、承受风险的能力以及投资经验 都有较高的要求。客户
            签署本协议书，代表对朗润金融业务的风险已有充分的认知及了 解。</p>
          <p class='indent2'>本揭示旨在向客户充分揭示投资风险，并帮助客户评估和确定自身能力。本揭示书披露 了
            交易过程中可能发生的诸多风险，但因期货授信交易业务的特殊性，不可能包括所有交易 的
            风险。鉴于投资风险的存在，客户在签订本协议书及进行交易前，应该仔细阅读本风险揭 示
            书，必须确保自己理解有关交易的性质、规则；并依据自身的投资经验、目标、财务状 况、
            承担风险的能力等自行决定是否参与此交易。</p>
          <p>若客户对于本揭示书有不理解或不清晰的地方，应该及时向朗润金融咨询相关信息， 对
            揭示书不存在任何异议时，请亲自确认</p>
          <p>一、温馨提示</p>
          <p>1. 期货授信交易业务具有高投机性和高风险性，不适合利用养老基金、债务基金（如银行
            贷款）等进行投资的客户。</p>
          <p>2. 期货授信交易业务只适合于满足以下全部条件的客户：</p>
          <p>（1） 年满 18 周岁并具有完全民事行为能力的中国公民；</p>
          <p>（2） 能够充分理解有关此交易的一切风险，并且具有风险承受能力的客户，年满 60 周岁
          并具有完全民事行为能力的中国公民，须更为谨慎地评估风险承受能力和自身的身体健康 状
          况；</p>
          <p>（3） 因投资失误而造成账户资金部分或全部损失，仍不会改变其正常生活方式或影响其正 常
          生产经营的客户。</p>
          <p>二、相关的风险揭示</p>
          <p>（一）政策风险</p>
          <p>由于国家法律、法规、政策的变化，紧急措施的出台，相关监管部门监管措施的实施，期货市
          场交易规则的修改等原因，均可能会对客户产生影响，客户必须承担由此导致的损失。</p>
          <p>（二）价格波动的风险</p>
          <p>期货投资作为一种特殊的具有投资价值的商品，其价格受多种因素的影响（如国际经济形 势、
          美元汇率、相关市场走势、政治局势、原油价格等），这些因数对期货投资价格的影响 机制
          非常复杂，客户在实际操作中难以全面把握，因而存在出现投资失误的可能性，如果不 能有
          效控制风险，则可能遭受较大的损失，客户必须独自承担由此导致的一切损失。
          </p><p>（三）技术风险
          </p><p>期货授信交易业务通过电子通讯技术和互联网技术来实现。有关通讯服务及软、硬件服务由
          不同的供应商提供，可能会存在品质和稳定性方面的风险；杭州壮云不能控制电讯信号的强
          弱，也不能保证交易客户端的设备配置或者连接的稳定性以及互联网传播和接受的实时性。
          故由以上通讯或网络故障导致的某些服务中断或延时可能会对客户的投资产生影响。另外，
          客户的电脑系统可能被病毒或网络黑客攻击，从而使客户的投资产生影响，无法正确或及时
          执行。对于上述不确定因素的出现也存在着一定的风险，有可能会对客户的投资产生影响，
          客户应该充分了解并承担由此造成的全部损失。
          </p><p>（四）交易风险
          </p><p>（1） 客户需要了解交易市场的期货投资业务具有杠杆比例，盈亏波动较大的特点。若建仓的 方
          向与行情的波动相反，会造成较大的亏损。根据亏损的程度，客户必须有条件满足随时追加预
          付款的要求，否则其持仓可能会被强行平仓，客户必须承担由此造成的全部损失。
          </p><p>（2） 客户在交易市场的交易系统内，通过网上终端所提交的市价单一经成交，即不可撤 销，
          客户必须接受这种方式可能带来的风险。
          </p><p>（3） 客户通过杭州壮云电子商务以电话的方式下市价单，一经交易部报价确认后，即不可 撤
          销或撤回，客户必须接受此种报单方式有可能带来的风险。
          </p><p>（4） 杭州壮云电子商务及其工作人员不会对客户作出获利保证，并且不会与客户分享收益 或
          共担风险。客户应知晓针对期货授信交易业务的任何获利保证或者不会发生亏损的承诺 均为
          不可能和没有根据的。
          </p><p>（5） 客户的成交单据必须是建立在自己的自主决定之上。杭州壮云及其员工提供的任何关 于
          市场的分析和信息，仅供客户参考，同时也不构成任何要约。客户因参考或采纳以上信 息而
          造成的交易风险由客户自行承担。
          </p><p>（6） 在电话以及电子交易过程中，由于技术故障或其他不可抗力因素，有可能出现偶然性 的
          错误报价，交易市场有权在事后对错价及错价产生的盈亏作出纠正，客户应接受相关纠 错行
          为，由此而造成的交易风险由客户承担。
          </p><p>（五）不可抗力风险
          </p><p>任何因交易市场不能够控制的原因，包括但不限于地震、水灾、火灾、暴动、罢工、战争、
          政府管制、国际或国内的禁止或者限制以及停电、技术故障、电子故障等其他无法预测和防
          范的不可抗力事件，都有可能会对客户的交易产生影响，客户应该充分了解并承担由此造成
          的全部损失。</p>

          <p>三、特别提示
          </p><p>1. 客户在参与投资之前务必详尽的了解期货投资投资的基本知识和相关风险以及交易市场
          有关的业务规则等，依法合规地从事期货投资业务。
          </p><p>2. 朗润金融与现有的期货投资交易市场相比，在交易模式、交易规则等方面完全一致，港
          唯国际为了确保市场“公开、公平、公正”和健康稳定地发展，将采取更加严格的措施以
          强化市场的监管。请客户务必密切关注朗润金融的公告、风险提示等信息，及时了解市场 风
          险状况，做到理性投资，切忌盲目跟风。
          </p><p>3. 客户在开通交易之前，请配合朗润金融完成客户的适当性管理工作，完整、如实地提供
          开户所需要的信息，不得采取弄虚作假等手段规避相关要求，否则，杭州壮云有权拒绝为 客
          户开通服务。
          </p><p>4. 本风险提示书提及的上述风险揭示事项仅为列举性质，未能详尽的列明交易市场期货投资交 易
          的所有风险，客户参与投资之前，还应认真对其他可能存在的风险有所了解和掌握。
          </p><p>5. 我们诚挚的希望和建议客户，从自身风险承受能力等实际情况出发，审慎地决定是否参
          与期货投资。
          </p><p>关于禁止代客交易的说明
          </p><p>禁止代客交易及变相代客交易，严厉禁止我单位及下辖业务体系内的任何机构或个人向您提
          供具体细化至某一指定点位建仓平仓的信息参考，请广大客 户提高防范意识，勿将交易账户
          交由他人操作，亦可及时向我司举报代客交易或变相代客 交易行为。对由于代客交易行为
          产生的交易风险及损失，我司不承担任何责任。</p>
        </div>
      </div>
    </section>
  </layout>
</template>
<script>
  export default {
    data() {
      return {
        isNavbar: true
      }
    }, created() {
      this.isOsAccess()
    },
    methods: {
      isOsAccess() {
        if (this.$route.query.os == 'app_ios' || this.$route.query.os == 'app_android') {
          this.isNavbar = false
        }
      },
      goBack() {
        this.$router.back()
      }
    }
  }
</script>
<style lang="less">
  @import "protocol.less";
</style>
